var dicHindle={
		dic:{
			"qllx":{
				"1":"集体土地所有权",
				"2":"国家土地所有权",
				"3":"国有建设用地使用权",
				"4":"国有建设用地使用权/房屋（构筑物）所有权",
				"5":"宅基地使用权",
				"6":"宅基地使用权/房屋（构筑物）所有权",
				"7":"集体建设用地使用权",
				"8":"集体建设用地使用权/房屋（构筑物）所有权",
				"9":"土地承包经营权",
				"10":"土地承包经营权/森林、林木所有权",
				"11":"林地使用权",
				"12":"林地使用权/森林、林木使用权",
				"13":"草原使用权",
				"14":"水域滩涂养殖权",
				"15":"海域使用权",
				"16":"海域使用权/构（建）筑物所有权",
				"17":"无居民海岛使用权",
				"18":"无居民海岛使用权/构（建）筑物所有权",
				"19":"地役权",
				"20":"取水权",
				"21":"探矿权",
				"22":"采矿权",
				"99": "其它权利"
				},
				"djlx":{
					"100":	"首次登记",
					"200":	"转移登记",
					"300":	"变更登记",
					"400":	"注销登记",
					"500":	"更正登记",
					"600":	"异议登记",
					"700":	"预告登记",
					"800":	"查封登记",
					"900":	"其它登记"

				},
				"fwyt":{
					"10":	"住宅",
					"11":	"成套住宅",
					"111":	"别墅",
					"112":	"高档公寓",
					"12":	"非成套住宅",
					"13":	"集体宿舍",
					"20":	"工业、交通、仓储",
					"21":	"工业",
					"22":	"公共设施",
					"23":	"铁路",
					"24":	"民航",
					"25":	"航运",
					"26":	"公共运输",
					"27":	"仓储",
					"30":	"商业、金融、信息",
					"31":	"商业服务",
					"32":	"经营",
					"33":	"旅游",
					"34":	"金融保险",
					"35":	"电讯信息",
					"40":	"教育、医疗、卫生、科研",
					"41":	"教育",
					"42":	"医疗卫生",
					"43":	"科研",
					"50":	"文化、娱乐、体育",
					"51":	"文化",
					"52":	"新闻",
					"53":	"娱乐",
					"54":	"园林绿化",
					"55":	"体育",
					"60":	"办公",
					"70":	"军事",
					"80":	"其它",
					"81":	"涉外",
					"82":	"宗教",
					"83":	"监狱",
					"84":	"物管用房"
				},
				"fwxz":{
					"0":	"市场化商品房",
					"1":	"动迁房",
					"2":	"配套商品房",
					"3":	"公共租赁住房",
					"4":	"廉租住房",
					"5":	"限价普通商品住房",
					"6":	"经济适用住房",
					"7":	"定销商品房",
					"8":	"集资建房",
					"9":	"福利房",
					"99":	"其它"

				},
				"qlrlx":{
					"1":	"个人",
					"2":	"企业",
					"3":	"事业单位",
					"4":	"国家机关",
					"99": 	"其它"

				},
				"zjzl":{
					"1":	"身份证",
					"2":	"港澳台身份证",
					"3":	"护照",
					"4":	"户口簿",
					"5":	"军官证（士兵证）",
					"6":	"组织机构代码",
					"7":	"营业执照",
					"99":	"其它",

				},
				"mjdw":{
					"1":	"平方米",
					"2":	"亩",
					"3":	"公顷",

				},
				"qlxz":{
					"100":	"国有土地",
					"101":	"划拨",
					"102":	"出让",
					"103":	"作价出资（入股）",
					"104":	"国有土地租赁",
					"105":	"授权经营",
					"106":	"家庭承包",
					"107":	"其它方式承包",
					"200":	"集体土地",
					"201":	"家庭承包",
					"202":	"其它方式承包",
					"203":	"批准拨用",
					"204":	"入股",
					"205":	"联营",
					"108":	"其他政府储备土地",
					"206":	"集体土地租赁",
					"207":	"集体土地出让",
				},
				"qxsd":{
					"1":"地上",
					"2":"地表",
					"3":"地下",
				},
				"fwjg":{
					"1":"钢结构",
					"2":"钢和钢筋混凝土结构",
					"3":"钢筋混凝土结构",
					"4":"混合结构",
					"5":"砖木结构",
					"6":"其它结构",

				},
				"zsbs":{
					"0":"单一版",
					"1":"集成版",
				},
				"judge":{
					"0":"否",
					"1":"是",
				}
		},
	getName:function(index,type){
		var data;
		if(index||index==0){
			for(var i in dicHindle.dic){
				if(i==type){
					data=dicHindle.dic[i]
				}
			}
			for(var i in data){
				if(i==index){
					return data[i]
				}
			}
			return (index.toString)
		}
	}
		}